// // //一球从100米高度自由落下，每次落地后反跳回原高度的一半；再落下，求它在第10次落地时，共经过多少米？第10次反弹多高？
// #include<stdio.h>
// int main()
// {
//     double h , i , s;
//     h = 100;
//     s = 100;
//     for(i=1;i<=10;i++)
//     {
//     h/=2;
//     s+=2*h;//下落的路程加上上升的路程
//     }
//     printf("path length:%.3f  height:%.3f",s ,h);

// }
// //上升和下落的路程也可以这样表示
// #include<stdio.h>
// int main()
// {
//     double h , i , s;
//     h = 100;
//     s = 0;
//     for(i=1;i<=10;i++)
//     {
//     s+=h;//上次下落的路程
//     h/=2;//回弹到多少米了
//     s+=h;//上升的路程         
//     }
    
//     printf("path length:%.5f  height:%.5f",s ,h);

// }
//为什么前面的方法，总路程总数字对不上
//因为没有加落地的时间，循环的10次算了第11次回落
//解决办法就是将落地打印放在后面，最后一次的循环成为第十次落地
// #include<stdio.h>
// int main()
// {
//     double h , i , s;
//     h = 100;
//     s = 0;
//     for(i=1;i<=10;i++)//从第一次回弹开始，落地比回弹前一轮
//     {
//     s+=h;//回落
//     h/=2;//回弹到多少米了
//     if(i!=10){
//     s+=h;//上升的   
//     //s+=h;//下降的 
//     }    
//     } 
//     printf("path length:%.5f  height:%.5f",s ,h);

// }
//最后问题在于第10次反弹在第10次回落后，算的时候不应该把第11次回落算进去，即第10次反弹
//有没有更简便的？
#include<stdio.h>
int main(){
   double h , i , s;
   h = 100;
   s = 100;
   for(i=2;i<=10;i++){
   h/=2;
   s+=2*h;
   }
   h/=2;//这个放前面也可以，循环里面位置调一下
   printf("path length:%.5f  height:%.5f",s ,h);
   return 0;
}