// //用*号输出字母C的图案。
// #include<stdio.h>
// int main()
// {
//     printf("****\n");
//     printf("*\n");
//     printf("*\n");
//     printf("****\n");
// }//奶奶题，我好奇其他字母怎么弄的
// #include<stdio.h>

// int main()
// {
//     char c[7][5] = {
//     {' ','*','*','*',' '},
//     {'*',' ',' ',' ','*'},
//     {'*',' ',' ',' ',' '},
//     {'*',' ',' ',' ',' '},
//     {'*',' ',' ',' ',' '},
//     {'*',' ',' ',' ','*'},
//     {' ','*','*','*',' '}
//     };

//     int i, j;

//     for (i = 0; i < 7; i++)
//     {
//         for (j = 0; j < 5; j++)printf("%c", c[i][j]);
//         printf("\n");
//     }
// }
// //我来写一个D
#include<stdio.h>
 int main(){
    char D[8][5]={
        {'*','*',' ',' ',' '},
        {'*',' ','*',' ',' '},
        {'*',' ',' ','*',' '},
        {'*',' ',' ','*',' '},
        {'*',' ',' ','*',' '},
        {'*',' ',' ','*',' '},
        {'*',' ','*',' ',' '},
        {'*','*',' ',' ',' '},
    };
    int i,j;
    for(i=0;i<8;i++){//行循环为外层循环
        for(j=0;j<5;j++){//列循环为内层循环，内层循环需要全部执行完，才到外层循环c[0][0], c[0][1], c[0][2], c[0][3], c[0][4]
        printf("%c",D[i][j]);}//每内循环一次打印一次
        printf("\n");//内循环结束跳出内循环，实现换行
    }
}
// //外层循环设置 i=0（第一行）。

// 内层循环 j 从0到4，打印 c[0][0], c[0][1], c[0][2], c[0][3], c[0][4]。

// 内层循环结束，执行 printf("\n") 换行。

// 外层循环 i 增加为1（第二行）。

// 重复步骤2-4，直到 i 达到7（即7行全部打印完毕）。
