// 某个公司采用公用电话传递数据，数据是四位的整数，在传递过程中是加密的，加密规则如下：
//  每位数字都加上5,然后用和除以10的余数代替该数字，再将第一位和第四位交换，第二位和第三位交换。
// 1.输入四位数字 2.每个数字加5 3.每个数之和 4.和除以10的余数 5.交换
// 1234 6789 6/%10 7%10 8%10 9%10 6 7 8 9 9876
#include <stdio.h>
// int main()
// {
//     int a[4], i,temp;
//     for (i = 0; i < 4; i++)
//     {
//         scanf("%d", &a[i]);
//         a[i]=(a[i]+5)%10;
//     }
//     for (i = 0; i < 2; i++)
//     {
//         temp = a[i];
//         a[i] = a[4-i-1];
//         a[4-i-1] = temp;
//     }
//         for (i = 0; i < 4; i++)
//     {
//         printf("%d ",a[i]);
//     }
//     return 0;
// }
// 老师的思路字符串
int main()
{
    char a[4] = "";
    scanf("%s", a);
    for (int i = 0; i < 4; i++)
    {
        a[i] = a[i] + 5;
        a[i] = (a[i] - '0') % 10;//转化为数字
        printf("%d ", a[i] ); // 单独输出的是字符
    }//后面的反转一样
    return 0;
}
